---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.DocumentCreatingEventArgs
source: html/cf00a154-4096-e10c-fb3c-a8eda1f58200.htm
---
# DocumentCreatingEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.